GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c

//*******1*********2*********3*********4*********5*********6*********7**********
//
//                             board_STM32_i2c.c
//
//
//  Common Logic for I2C support for STM32 MCUs.
//
//  Uses a combination of HAL_Library (mostly for configuration) and direct
//  register calls (main execution).
//
//  Specific chip dependences are mainly constrained to tables (GPIOs used
//  specific TIMx modules supported, etc). They are pulled in as #includes
//  based on MCU type.
//
//  In general, the use of #ifdefs within the code has been minimized, in
//  order to keep things read-able and maintainable.
//
//  History:
//    05/30/15 - Created for Industrial IoT OpenSource project.  Duq
//    07/30/15 - Reworked to provide better factoring. Worked first shot. Duq
//    08/10/15 - Tweaked Interrrupt Handling. Duquaine
// -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -
//
// The MIT License (MIT)
//
// Copyright (c) 2014-2015 Wayne Duquaine / Grandview Systems
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
// 
// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
// THE SOFTWARE.
//******************************************************************************

#include "user_api.h"         // pull in high level User API defs
#include "device_config_common.h"     // device config stuff for I2C_TIMING, etc
#include "boarddef.h"


#define  MAX_I2C_ID    100                // ??? !!  TWEAK THIS  WVD   !!! ???

typedef struct i2c_gio_def                  /* I2C GPIO pin definitions */
    {
        uint32_t     i2c_chan_alt_func;     /* I2C Alternate Function Id     */
        int8_t       i2c_pin_role;          /* acts in SCL or SDA role       */
        uint8_t      i2c_pin_number;        /* logical pin number 0-255      */
    } I2C_GPIO_BLK;

                    // valid values for i2c_pin_role
#define  SCL_PIN_ROLE   1
#define  SDA_PIN_ROLE   2



typedef struct i2c_io_block            /* I2C I/O Control Block (I/O Buffers) */
    {
        uint8_t      *i2c_buffer;      /* Ptr to current spot in User I/O buf */
        uint16_t     i2c_length;       /* Amount of data left to send/rcv     */
        uint8_t      i2c_init;         /*     1 = has been initialized        */
        uint8_t      i2c_state;        /* Current state of the I2C module     */
        uint8_t      i2c_use_interrupts; /* 1 = use interrupts,     0 = poll  */
        uint8_t      i2c_blocking;     /* 1 = I/O is blocking. Wait till I/O is
                                       **  complete before return to user app */
        uint8_t      i2c_master_slave; /* 1 = Master, 2 = Slave               */
        int          i2c_semaphore;    /* I/O wait semaphore                  */
        uint32_t     i2c_max_timeout;  /* max time to wait for I/O (millisec) */
        uint32_t     i2c_expiry_time;  /* timeout deadline for I2C I/O response */
     I2C_HandleTypeDef    *i2c_handle; /* HAL I2C Handle to use for this I/O  */
     I2C_CB_EVENT_HANDLER i2c_callback_handler;  /* optional callback routine */
        void              *i2c_callback_parm;    /* user callback parm        */
    } I2C_IO_BUF_BLK;

                    // valid values for i2c_state
#define  I2C_STATE_UNINITIALIZED    0   /* I2C has not been initialized */
#define  I2C_STATE_RESET            1   /* I2C is reset, not in use     */
#define  I2C_STATE_IO_PROCESSING    2   /* I2C I/O is in progress       */
#define  I2C_STATE_IO_PEND_COMPLETE 3   /* I2C I/O waiting for final complete */
#define  I2C_STATE_IO_COMPLETED     4   /* I2C I/O is fully complete    */
#define  I2C_STATE_ERROR_COMPLETE   5   /* I2C I/O completed with an error */


void board_i2c_enable_nvic_irq (int module_id);
void board_i2c_stop_io (I2C_IO_BUF_BLK *ioblock);  // internal routines protos
int  board_i2c_write_byte (I2C_IO_BUF_BLK *ioblock, uint8_t byte_Value);
void Internal_HAL_I2C_TxRxCpltCallback (I2C_HandleTypeDef *hi2c, int rupt_num);


     //------------------------------------------------------------------------
     //
     // Pull in        MCU dependent GPIO / TIM tables and #defines
     //
     // The top of each module include key defines for:
     //          MAX_TIMERS,
     //          TMRPWM_NUM_MODULES
     //          TMRPWM_MAX_CHANNELS
     //
     // The following tables are pulled in:
     //          _g_timer_module_base[]       table/array
     //          _g_TIMx_TimPwmHandle's
     //          _g_timer_typedef_handle[]    table/array       was _g_timer_module_handle
     //          _g_TMPWM_IRQ_table[]         table/array
     //          _g_timer_base_channel_num[]  table/array
     //          _g_tmrpwm_mod_x_channels []  set of tables/arrays for GPIOs
     //          _g_tmrpwm_mod_channel_blk_lookup []    table/array
     //
     // Also, the following two utility routines are included in those files:
     //        - board_timerpwm_compute_prescalar()  because that is MCU speed
     //                                              and clock specific
     //        - board_timerpwm_enable_clock()       because which Timers are
     //                                              supported and the logic to
     //                                              start them is MCU specific
     //------------------------------------------------------------------------

#if defined(__STM32F072__) || defined(STM32F072xB)
//                                         STM32 - F072  Nucleo
#include "STM32_F0/board_F0_tables_i2c.c"
#define  MAX_I2C   2
#endif


