GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c
#if defined(__STM32F091__) || defined(STM32F091xC)
//                                         STM32 - F091  Nucleo
#include "STM32_F0/board_tables_F0_i2c.c"
#define  MAX_I2C   2
#endif


#if defined(__STM32F103__) || defined(STM32F103xB)
//                                         STM32 - F103  Nucleo
#include "STM32_F1/board_F1_tables_i2c.c"
#define  MAX_I2C   4
#endif


#if defined(STM32F303xC) || defined(STM32F303xE)
//                                         STM32 - F303  Nucleo and Discovery
#include "STM32_F3/board_F303_tables_i2c.c"
#define  MAX_I2C   2
#endif


#if defined(STM32F334x8)
//                                         STM32 - F334  Nucleo and Discovery
#include "STM32_F3/board_F334_tables_i2c.c"
#define  MAX_I2C   1
#endif


#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
//                                         STM32 - F401/F411  Nucleos
#include "STM32_F4/board_F4x1_tables_i2c.c"
#define  MAX_I2C   4
#endif

#if defined(STM32F446xx)
//                                         STM32 - F446  Nucleo
#include "STM32_F4/board_F446_tables_i2c.c"
#define  MAX_I2C   4
#endif


#if defined(STM32F746xx) || defined(STM32F746NGHx)
//                                         STM32 - F746  Discovery
#include "STM32_F7/board_F7_tables_i2c.c"
#define  MAX_I2C   6
#endif


#if defined(__STM32L053__)  ||  defined(STM32L053xx)
//                                         STM32 - L053  Nucleo
#include "STM32_L0/board_L0_tables_i2c.c"
#define  MAX_I2C   2
#endif


#if defined(STM32L152xE) || defined(STM32L152xC)
//                                         STM32 - L152  Nucleo
#include "STM32_L1/board_L1_tables_i2c.c"
#define  MAX_I2C   2
#endif


#if defined(STM32L476xx)
//                                         STM32 - L476  Discovery/Nucleo
#include "STM32_L4/board_L4_tables_i2c.c"
#define  MAX_I2C   3
#endif


//*****************************************************************************
//*****************************************************************************
//                      COMMON   TABLES and DEFINEs
//
//                                for
//
//                                I2C
//*****************************************************************************
//*****************************************************************************

    int           init_mod_id   = 0;     // DEBUG ONLY
    int           init_mod_num  = 0;     // DEBUG ONLY
I2C_IO_BUF_BLK    *init_ioblock = 0L;    // DEBUG ONLY
I2C_HandleTypeDef *init_pI2cHdl = 0L;    // DEBUG ONLY

    int           writ_mod_id   = 0;     // DEBUG ONLY
    int           writ_mod_num  = 0;     // DEBUG ONLY
I2C_IO_BUF_BLK    *writ_ioblock = 0L;    // DEBUG ONLY
I2C_HandleTypeDef *writ_pI2cHdl = 0L;    // DEBUG ONLY


int  board_i2c_enable_clock (int module_id);    // Prototypes for internal rtns
int  board_i2c_get_module_ioblk (unsigned int i2c_module_lid, I2C_IO_BUF_BLK **ret_ioblock);

extern   const  int  _g_gpio_pull_flags[];  // defined in board_XX_tables_i2c.c


//*****************************************************************************
//*****************************************************************************
//                               I2C   Routines
//*****************************************************************************
//*****************************************************************************

/*******************************************************************************
* board i2c init function
*
*         Configures this MCU's I2C peripheral and its associated GPIOs.
*
*         The I2C Module Id specifies, both the I2C Module and the sub-variant
*         pins to use for that that module.
*
*         The module_id is split:
*             bottom low order 4 bits (0..3) = pin variant.
*             next nibble up (bits 4-7)      = actual I2C module number 0-5
*
*
*                SCL      SDA
*                ----     ----
*         I2C1 = PA5   /  PA7
*           "    PB3   /  PB5    (alternate pin mode)
*         I2C2 = PB13  /  PC3
*           "    PB13  /  PB15   (alternate pin mode)
*         I2C3 = PC10  /  PC12
*           "    PB3   /  PB5    (alternate pin mode)
*
*  flags:   use_dma,   USES_BLUENRG_BLE, GPIO_OUT_PULLUP, GPIO_IN_PULL_UP/DOWN
*
* 07/31/15
*    Added option for user to pass in his own I2C_HandleTypeDef handle, instead
*    of using our internal one. This preserves some vendor I2C legacy code, that
*    have a very high dependency on using their own I2C_HandleTypeDef handle.
*******************************************************************************/

int  board_i2c_init (unsigned int i2c_module_id, int scl_pin_id, int sda_pin_id,
                     int master_slave, int my_local_address,
                     long i2c_baud_timing,  int flags,
                     I2C_HandleTypeDef *caller_hi2c_ptr)   // TEMP HACK 07/30/15
{
    I2C_HandleTypeDef  *pI2cHdl;
    I2C_TypeDef        *i2c_hwbase;
    I2C_IO_BUF_BLK     *ioblock;
    int                rc;
    int                pull_flags_idx;
    int                scl_pull_flags;
    int                sda_pull_flags;
    GPIO_TypeDef       *scl_GPIO_port;    /* SCL GPIO port   */
    uint32_t           scl_GPIO_pin;      /* SCL GPIO pin    */
    uint32_t           scl_AltFuncId;     /* SCL Alt Func Id (pin mux) */
    GPIO_TypeDef       *sda_GPIO_port;    /* SDA GPIO port   */
    uint32_t           sda_GPIO_pin;      /* SDA GPIO pin    */
    uint32_t           sda_AltFuncId;     /* SDA Alt Func Id (pin mux) */
    GPIO_InitTypeDef   GPIO_InitStruct;

init_mod_id  = i2c_module_id;  // DEBUG ONLY

    if (i2c_module_id > MAX_I2C_ID)
       return (ERR_I2C_MODULE_ID_OUT_OF_RANGE);

         //--------------------------------------------------------------
         // Get pointer to the I2C I/O Block to use for this module
         //--------------------------------------------------------------
    ioblock = (I2C_IO_BUF_BLK*) _g_i2c_io_blk_address [i2c_module_id];
init_ioblock = ioblock;         // DEBUG ONLY

