GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c
         //---------------------------------------------------------------------
         // If module was already initialized - skip doing it again, and issue a warning
         //---------------------------------------------------------------------
    if (ioblock->i2c_init)
       return (WARN_I2C_WAS_ALREADY_INITIALIZED);

       //---------------------------------------------------------------------
       // Get pointers to I2C MODULE Hardware base address, and TypeDef Handle
       //---------------------------------------------------------------------
    i2c_hwbase = (I2C_TypeDef*) _g_i2c_HW_module_base [i2c_module_id];
    pI2cHdl    = (I2C_HandleTypeDef*) _g_i2c_typedef_handle_addr[i2c_module_id];
    if (caller_hi2c_ptr != 0L)
       {   // caller wants to use _his_ I2C_TypeDef handle, not our internal one
         pI2cHdl = caller_hi2c_ptr;              // TEMP HACK 07/30/15t
       }
init_pI2cHdl   = pI2cHdl;          // DEBUG ONLY

       //---------------------------------------------------------------------
       // Locate the associated GPIO Port and GPIO Pin for SCL and SDA pins
       //---------------------------------------------------------------------
    rc = board_gpio_pin_lookup (scl_pin_id, &scl_GPIO_port, &scl_GPIO_pin);
    if (rc == 0)
       rc = board_gpio_pin_lookup (sda_pin_id, &sda_GPIO_port, &sda_GPIO_pin);
    if (rc != 0)
       return (rc);                  // invalid pin_id was given to us

       //---------------------------------------------------------------------
       // Locate the associated GPIO ALTERNATE_FUNCTION (AF) information.
       //---------------------------------------------------------------------
    rc = board_i2c_ALTFUNC_lookup (i2c_module_id, scl_pin_id, &scl_AltFuncId,
                                   sda_pin_id, &sda_AltFuncId);
    if (rc != 0)
       return (rc);                  // pin_id not valid for this I2C instance

         //-----------------------------------------------------------------
         //           GPIO  Pin  Config  -  for I2C operation
         //
         // Setup the GPIO pins to operate in I2C mode  (pin muxing).
         // Configures SCL and SDA pins.
         //-----------------------------------------------------------------
    pull_flags_idx = (flags & 0x0003);                     // flags for SCL
    scl_pull_flags = _g_gpio_pull_flags[pull_flags_idx];
    pull_flags_idx = ((flags & 0x0030) >> 4);              // flags for SDA
    sda_pull_flags = _g_gpio_pull_flags[pull_flags_idx];

    memset (&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct)); // clear struct

#if defined(GPIO_SPEED_FAST)
    GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;   // Handle F0 vs F4 etc HAL inconsistencies
#else
    GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
#endif
    GPIO_InitStruct.Pin       = scl_GPIO_pin;;
    GPIO_InitStruct.Alternate = scl_AltFuncId;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_OD;     // Alt Func Open_Drain
    GPIO_InitStruct.Pull      = scl_pull_flags;
    HAL_GPIO_Init (scl_GPIO_port, &GPIO_InitStruct); // Setup SCL pin

    GPIO_InitStruct.Pin       = sda_GPIO_pin;
    GPIO_InitStruct.Alternate = sda_AltFuncId;
    GPIO_InitStruct.Pull      = sda_pull_flags;
    HAL_GPIO_Init (sda_GPIO_port, &GPIO_InitStruct); // Setup SDA pin

       //---------------------------------------------------------------------
       // Initialize the I2C MODULE I/O Block
       //---------------------------------------------------------------------
    ioblock->i2c_init  = 1;                      // tag it as been initialized
    ioblock->i2c_state = I2C_STATE_RESET;        // set to initial state

    ioblock->i2c_master_slave = master_slave;    // save type and mode

    ioblock->i2c_handle = pI2cHdl; // Save I2C handle to use during I/O processing

         //--------------------------------------------------------------
         // Turn on the clock for the physical I2C module
         //--------------------------------------------------------------
    board_i2c_enable_clock (i2c_module_id);

#if defined(USE_DMA)
         //----------------------------------------
         //    I2C2  DMA and Interrupts  Enable
         //----------------------------------------
    board_i2c_dma_init();
    HAL_NVIC_SetPriority (I2C2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ (I2C2_IRQn);
#endif

         //------------------------------------------------------------
         //                      I2C Module Config
         //
         //          Setup HAL info needed for I2C Configuration
         //------------------------------------------------------------
    memset (pI2cHdl, 0, sizeof(I2C_HandleTypeDef));    // ensure is cleared out

    pI2cHdl->Instance             = i2c_hwbase;  // set assoc I2C HW module in HAL TypeDef
    pI2cHdl->Init.OwnAddress1     = my_local_address;  // set our local address

/// pI2cHdl->Init.Mode            = I2C_MODE_MASTER;   // Master vs Slave is selected by API calls

    pI2cHdl->Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
/// pI2cHdl->Init.AddressingMode  = I2C_ADDRESSINGMODE_10BIT;  // F303 Discovery - MAKE CONFIG OPTION FLAG ?

#if defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F446xx) \
 || defined(USE_STM32L1XX_NUCLEO)
             // F4 and L1 use Baud based Clock Speed
    pI2cHdl->Init.ClockSpeed = i2c_baud_timing;      // default is 400K
    pI2cHdl->Init.DutyCycle  = 0;   // ??? !!! COMPUTE THIS BASED ON BAUD ??? WVD ??? !!!
#endif

#if defined(USE_STM32F0XX_NUCLEO) || defined(STM32F072xB) || defined(STM32F091xC) \
 || defined(USE_STM32F3XX_NUCLEO) || defined(USE_STM32746G_DISCO) \
 || defined(STM32L053xx) || defined(STM32L476xx)
             // F0, F3, F7, L0, and L4 use encoded Timing construct
    pI2cHdl->Init.Timing     = i2c_baud_timing;
#endif

#if defined(USE_STM32F3XX_NUCLEO) || defined(USE_STM32746G_DISCO)
              // F303 & F7 Discovery
    pI2cHdl->Init.NoStretchMode   = I2C_NOSTRETCH_DISABLED;
    pI2cHdl->Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
#endif
            //----------------------------------------
            //     Initialize/configure I2C module
            //----------------------------------------
    rc = HAL_I2C_Init (pI2cHdl);     // go intialize the I2C module

#if defined(USE_STM32F3XX_NUCLEO) || defined(USE_STM32746G_DISCO)
          // Enable the Analog I2C Filter - F303, F7_46 Discovery
    HAL_I2CEx_AnalogFilter_Config (pI2cHdl, I2C_ANALOGFILTER_ENABLED);  // !!! CONFIG OPTION !!!
//  HAL_I2CEx_ConfigAnalogFilter (pI2cHdl, I2C_ANALOGFILTER_ENABLE);
#endif

