GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c
            //----------------------------------------
            //     Enable I2C module via CR1
            //----------------------------------------
//  __HAL_I2C_ENABLE (pI2cHdl);      // turn on I2C Enable flag I2C_CR1_SPE in CR1 WVD disabled 09/15/15

    if (flags & I2C_IO_USE_INTERRUPTS)
       {    //----------------------------------------
            //     Turn on Interrupts for I2C
            //----------------------------------------
         ioblock->i2c_use_interrupts = 1;          // denote using rupts

// NEED TO FIX THE FOLLOWING        ??? !!! WVD ??? !!!
// FIX   board_i2c_enable_nvic_irq (i2c_module_id);  // turn on interrupts

       }

    if (flags & I2C_IO_NON_BLOCKING)
       {       // que I/O and return to caller
         ioblock->i2c_blocking = 0;
       }
      else {   // We must block on Read/Write calls until I/O is complete
             ioblock->i2c_blocking = 1;            // turn on blocking mode
           }

    if (rc != HAL_OK)
       return (-1);             // denote I2C init failed
    return (0);                 // denote it worked OK
}


//--------------------------------------------------------------
//                FUTURE  -   DMA  Support
//--------------------------------------------------------------
                                  /* Definition for I2Cx clock resources */
#define DMAx_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
/* Definition for I2Cx's DMA */
#define I2Cx_TX_DMA_CHANNEL              DMA_CHANNEL_0
#define I2Cx_TX_DMA_STREAM               DMA1_Stream4
#define I2Cx_RX_DMA_CHANNEL              DMA_CHANNEL_0
#define I2Cx_RX_DMA_STREAM               DMA1_Stream3

/* Definition for I2Cx's NVIC */
#define I2Cx_DMA_TX_IRQn                 DMA1_Stream4_IRQn
#define I2Cx_DMA_RX_IRQn                 DMA1_Stream3_IRQn
#define I2Cx_DMA_TX_IRQHandler           DMA1_Stream4_IRQHandler
#define I2Cx_DMA_RX_IRQHandler           DMA1_Stream3_IRQHandler

#if defined(USE_DMA)
  static DMA_HandleTypeDef hdma_tx;
  static DMA_HandleTypeDef hdma_rx;
  DMAx_CLK_ENABLE();

  /* Configure the DMA handler for Transmission process */
  hdma_tx.Instance                 = I2Cx_TX_DMA_STREAM;

  hdma_tx.Init.Channel             = I2Cx_TX_DMA_CHANNEL;
  hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
  hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_tx.Init.Mode                = DMA_NORMAL;
  hdma_tx.Init.Priority            = DMA_PRIORITY_LOW;
  hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  hdma_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_tx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_tx.Init.PeriphBurst         = DMA_PBURST_INC4;

  HAL_DMA_Init (&hdma_tx);

      /* Associate the initialized DMA handle to the the I2C handle */
  __HAL_LINKDMA (hspi, hdmatx, hdma_tx);

      /* Configure the DMA handler for Transmission process */
  hdma_rx.Instance                 = I2Cx_RX_DMA_STREAM;

  hdma_rx.Init.Channel             = I2Cx_RX_DMA_CHANNEL;
  hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_rx.Init.Mode                = DMA_NORMAL;
  hdma_rx.Init.Priority            = DMA_PRIORITY_HIGH;
  hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  hdma_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_rx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_rx.Init.PeriphBurst         = DMA_PBURST_INC4;

  HAL_DMA_Init (&hdma_rx);

      /* Associate the initialized DMA handle to the the I2C handle */
  __HAL_LINKDMA (hspi, hdmarx, hdma_rx);

      /*##-4- Configure the NVIC for DMA #########################################*/
      /* NVIC configuration for DMA transfer complete interrupt (I2C3_TX) */
  HAL_NVIC_SetPriority (I2Cx_DMA_TX_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ (I2Cx_DMA_TX_IRQn);

      /* NVIC configuration for DMA transfer complete interrupt (I2C3_RX) */
  HAL_NVIC_SetPriority (I2Cx_DMA_RX_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ (I2Cx_DMA_RX_IRQn);
#endif                                        //  #if defined(USE_DMA)

#if defined(USE_DMA)
              //------------------------------------------
              // DMA init for I2C RX and TX directions
              //------------------------------------------
           _g_hdma_spi2_rx.Instance                 = DMA1_Channel4;    // RX
           _g_hdma_spi2_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
           _g_hdma_spi2_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
           _g_hdma_spi2_rx.Init.MemInc              = DMA_MINC_DISABLE; // ISSUE ???
           _g_hdma_spi2_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
           _g_hdma_spi2_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
           _g_hdma_spi2_rx.Init.Mode                = DMA_NORMAL;
           _g_hdma_spi2_rx.Init.Priority            = DMA_PRIORITY_MEDIUM;
           HAL_DMA_Init (&_g_hdma_spi2_rx);

           __HAL_LINKDMA (&_g_hspi2, hdmarx, _g_hdma_spi2_rx);

           _g_hdma_spi2_tx.Instance                 = DMA1_Channel5;  // TX
           _g_hdma_spi2_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
           _g_hdma_spi2_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
           _g_hdma_spi2_tx.Init.MemInc              = DMA_MINC_ENABLE;
           _g_hdma_spi2_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
           _g_hdma_spi2_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
           _g_hdma_spi2_tx.Init.Mode                = DMA_NORMAL;
           _g_hdma_spi2_tx.Init.Priority            = DMA_PRIORITY_MEDIUM;
           HAL_DMA_Init (&_g_hdma_spi2_tx);

           __HAL_LINKDMA (&_g_hspi2, hdmatx, _g_hdma_spi2_tx);
#endif                            // defined(USE_DMA)




