GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c
/*******************************************************************************
* Enable DMA controller clock and initialize DMA Interrupts
*******************************************************************************/
void  board_i2c_dma_init (void)
{
#if defined(DMA_ENABLED)
    __DMA1_CLK_ENABLE();               // DMA controller clock enable

        //--------------------------------------------
        //    DMA interrupts init
        //--------------------------------------------
    HAL_NVIC_SetPriority (DMA1_Channel4_IRQn, 0, 0);   // I2C RX
    HAL_NVIC_EnableIRQ (DMA1_Channel4_IRQn);
    HAL_NVIC_SetPriority (DMA1_Channel5_IRQn, 0, 0);   // I2C TX
    HAL_NVIC_EnableIRQ (DMA1_Channel5_IRQn);
#endif
}


//******************************************************************************
//  board_i2c_ALTFUNC_lookup
//
//        Finds/scans for the associated SCLK/MISO/MOSI GPIO Pin's
//        associated ALTERNATE FUNCTION (AF) information.
//        Returns the ALTERNATE_FUNCTION (AF) id for each pin.
//******************************************************************************

int  board_i2c_ALTFUNC_lookup (unsigned int module_id,
                               int scl_gpio_pin, uint32_t *scl_AltFuncId,
                               int sda_gpio_pin, uint32_t *sda_AltFuncId)
{
    I2C_GPIO_BLK   *gpio_blk_base;
    I2C_GPIO_BLK   *gpio_curr_ptr;

    gpio_blk_base = (I2C_GPIO_BLK*) _g_i2c_gpio_table_addr [module_id];
    if (gpio_blk_base == 0L)
       return (ERR_I2C_MODULE_NUM_NOT_SUPPORTED);

    *scl_AltFuncId = 0xFFFF;      // initially clear out the entries
    *sda_AltFuncId = 0xFFFF;

       // first, scan to locate the associated SCL pin support in the table
    gpio_curr_ptr = gpio_blk_base;
    while (gpio_curr_ptr->i2c_pin_role != -1)
      { if (gpio_curr_ptr->i2c_pin_number == scl_gpio_pin)
           { if (gpio_curr_ptr->i2c_pin_role == SCL_PIN_ROLE)
                { *scl_AltFuncId = gpio_curr_ptr->i2c_chan_alt_func;  // pass back associated Alternate Function Id
                  break;                       // we found desired pin. bail out
                }
           }
        gpio_curr_ptr++;                       // else step to the next entry
      }

       // then, scan to locate the associated SDA pin support in the table
    gpio_curr_ptr = gpio_blk_base;
    while (gpio_curr_ptr->i2c_pin_role != -1)
      { if (gpio_curr_ptr->i2c_pin_number == sda_gpio_pin)
           { if (gpio_curr_ptr->i2c_pin_role == SDA_PIN_ROLE)
                { *sda_AltFuncId = gpio_curr_ptr->i2c_chan_alt_func;  // pass back associated Alternate Function Id
                  break;                       // we found desired pin. bail out
                }
           }
        gpio_curr_ptr++;                       // else step to the next entry
      }

    if (*scl_AltFuncId == 0xFFFF || *sda_AltFuncId == 0xFFFF)
       return (ERR_I2C_PIN_ID_NOT_SUPPORTED);   // no match found in table

    return (0);                // denote operation completed successfully
}


//******************************************************************************
// board_i2c_check_io_completed
//
//          Check if I/O has completed.
//
//          Flags:    I2C_WAIT_FOR_COMPLETE  -  wait till I/O is complete.
//
//          Returns:
//              True  (1) = Completed
//              False (0) = Busy
//                    -1  = completed with error
//******************************************************************************
int  board_i2c_check_io_completed (unsigned int i2c_module_id, int flags)
{
    I2C_IO_BUF_BLK  *ioblock;
    int             rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

    if (ioblock->i2c_state == I2C_STATE_IO_PROCESSING)
       { if ((flags & I2C_WAIT_FOR_COMPLETE) == 0)
            return (0);                   // I/O still busy

             //-----------------------------------------------------------------
             // caller has requested: I2C_WAIT_FOR_COMPLETE.
             //
             // for Low Power or RTOS versions we would do a wait, until
             // the I/O interrupts completed.
             //-----------------------------------------------------------------
//       IO_SEMAPHORE_SET (ioblock->i2c_semaphore);
         IO_SEMAPHORE_WAIT (&ioblock->i2c_semaphore);  // go into LPM or RTOS proc switch --> See CC3100 LOGIC
       }

    if (ioblock->i2c_state == I2C_STATE_ERROR_COMPLETE)
       return (-1);                      // I/O Completed with error

    return (1);                          // I/O Completed successfully
}


//*****************************************************************************
//  board_i2c_get_handle
//
//             debugging hook used during board bring up to test new MCUs I2C.
//*****************************************************************************

I2C_HandleTypeDef *board_i2c_get_handle (unsigned int i2c_module_id)
{
    I2C_HandleTypeDef  *pI2cHdl;

    if (i2c_module_id < 0 || i2c_module_id > MAX_I2C_ID)
       return (0L);                    // invalid I2C module id

    pI2cHdl = (I2C_HandleTypeDef*) _g_i2c_typedef_handle_addr[i2c_module_id];

    return (pI2cHdl);                  // return HAL related I2C handle
}


/*******************************************************************************
* board_i2c_get_module_ioblk
*
*           Checks if the logical module id is valid, and returns
*           associated I2C io_block.
*
*           Returns:  0   if completed successfully
*                    -2xx if completed with error
*******************************************************************************/
int  board_i2c_get_module_ioblk (unsigned int i2c_module_id, I2C_IO_BUF_BLK **ret_ioblock)
{
    I2C_IO_BUF_BLK  *ioblock;

    if (i2c_module_id > MAX_I2C)
       return (ERR_I2C_MODULE_ID_OUT_OF_RANGE);

    ioblock = (I2C_IO_BUF_BLK*) _g_i2c_io_blk_address [i2c_module_id];  // get assoc I/O block
    *ret_ioblock = ioblock;           // pass back the associated I2C I/O block
                                      //      for that module
    return (0);                       // denote worked OK
}


//*****************************************************************************
//  board_i2c_set_callback
//
//          callback_function and callback_parm are used to provide callback
//          when any I2C interrupt completion (or terminating error) occurs.
//*****************************************************************************
int  board_i2c_set_callback (unsigned int i2c_module_id,
                             I2C_CB_EVENT_HANDLER callback_function,
                             void *callback_parm)
{
    I2C_IO_BUF_BLK  *ioblock;
    int             rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

       //-------------------------------------------------------------------
       // Save any call back information, for interrupts
       //-------------------------------------------------------------------

