GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c
    ioblock->i2c_callback_handler = callback_function;  // save callback info
    ioblock->i2c_callback_parm    = callback_parm;

    return (0);                        // denote completed OK
}


//*****************************************************************************
//  board_i2c_set_max_timeout
//
//          Set the maximum time that the MCU should wait for an I2C
//          send/receive transaction to complete.
//          If it exceeds this value, signal an error, and cancel the I/O
//          that was in progress.
//
// NOTE THAT WITH ST code, TIMEOUTs are _only_ used with Polled I/O.
//      Are _NOT_ used with Interrupt or DMA driven I/O  !!!
//*****************************************************************************
int  board_i2c_set_max_timeout (unsigned int i2c_module_id, uint32_t max_timeout)
{
    I2C_IO_BUF_BLK  *ioblock;
    int             rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

    ioblock->i2c_max_timeout = max_timeout;  // save Max Timeout value

    return (0);                        // denote completed OK
}


//*****************************************************************************
//  board_i2c_stop_io
//
//          An I2C I/O call (read/write/write_read) timed out.
//          Terminate any I/O in progress and reset back to start a new operation.
//
// NOTE THAT WITH ST code, TIMEOUTs are _only_ used with Polled I/O.
//      Are _NOT_ used with Interrupt or DMA driven I/O  !!!
//*****************************************************************************
void  board_i2c_stop_io (I2C_IO_BUF_BLK *ioblock)
{
        // ??? CALL HAL IF WE ARE USING HAL for I/O   -> use pi2c ptr in IOBLK
        // ??? HOW STOP AN I2C OPERATION ?   MUST IT BE RESET BACK LIKE INIT ?

        /* Disable TXE, RXNE and ERR interrupts when using interrupt process */
/// __HAL_I2C_DISABLE_IT (ioblock->i2c_handle, (I2C_IT_TXE | I2C_IT_RXNE | I2C_IT_ERR));

    __HAL_I2C_DISABLE(ioblock->i2c_handle);  // issue I2C disable to stop I/O

    ioblock->i2c_state = I2C_STATE_ERROR_COMPLETE;  // set our state


//   ??? !!!   Issue error callback to the user    ??? !!!


    __HAL_I2C_ENABLE(ioblock->i2c_handle);   // then re-anble I2C for new I/O
}



//*****************************************************************************
//  board_i2c_read
//
// @brief  Sets the registers of the EasySpin to their predefined values
//         from easyspin_target_config.h
// @param[in] pByteToTransmit pointer to the byte to transmit
// @param[in] pReceivedByte pointer to the received byte
// @retval    None
//*****************************************************************************

int  board_i2c_read (unsigned int i2c_module_id,  int slave_addr,
                     uint8_t *receive_buffer, int max_buf_length, int flags)
{
    I2C_HandleTypeDef *pI2cHdl;
    I2C_TypeDef       *spibase;
    I2C_IO_BUF_BLK    *ioblock;
    int               rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

       /* Before starting a new communication transfer, you need to check the current
       *  state of the peripheral; if it’s busy you need to wait for the end of current
       *  transfer before starting a new one.
       *  For simplicity reasons, this example is just waiting till the end of the
       *  transfer, but application may perform other tasks while transfer operation
       *  is ongoing. */
/// while (HAL_I2C_GetState(&I2cHandle) != HAL_I2C_STATE_READY)

    pI2cHdl   = ioblock->i2c_handle;           // get associated HAL handle
    if (ioblock->i2c_state == I2C_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);  // still working on a previous I/O

    ioblock->i2c_buffer = receive_buffer;    // save ptr to User I/O buf
    ioblock->i2c_length = max_buf_length;    // save amount of data to rcv
    ioblock->i2c_expiry_time = ioblock->i2c_max_timeout;   // set any max timeout

    ioblock->i2c_state = I2C_STATE_IO_PROCESSING; // denote I/O is now in progress

    if ( ! ioblock->i2c_use_interrupts)
       {        // polled I/O
         if (ioblock->i2c_master_slave == I2C_MASTER)
            rc = HAL_I2C_Master_Receive (ioblock->i2c_handle, slave_addr,
                                         receive_buffer,
                                         max_buf_length, ioblock->i2c_max_timeout);
           else rc = HAL_I2C_Slave_Receive (ioblock->i2c_handle,
                                            receive_buffer,
                                            max_buf_length, ioblock->i2c_max_timeout);
       }
      else {    // INTERRUPT driven I/O
             if (ioblock->i2c_master_slave == I2C_MASTER)
                rc = HAL_I2C_Master_Receive_IT (ioblock->i2c_handle, slave_addr,
                                                receive_buffer,
                                                max_buf_length);
               else rc = HAL_I2C_Slave_Receive_IT (ioblock->i2c_handle,
                                                   receive_buffer,
                                                   max_buf_length);
           }

// ??? WVD ??? !!! need to add check and wait for Blocking I/O
      // BLOCKING I/O - wait until I/O is complete, before return to app

    if (rc != HAL_OK)
       { ioblock->i2c_state = I2C_STATE_ERROR_COMPLETE;
            /* Error_Handler() function is called when Timout error occurs.
            ** When Acknowledge failure ocucurs (Slave don't acknowledge it's address)
            ** Master restarts communication */
////     if (HAL_I2C_GetError(&I2cHandle) != HAL_I2C_ERROR_AF)   return (xyz);
         return (-1);
       }
      else ioblock->i2c_state = I2C_STATE_IO_COMPLETED;  // Tag as successful I/O

    return (0);        // tell user it was started (Non-Block) or completed OK
}


//*****************************************************************************
//  board_i2c_write_header_data
//
// @brief  This is used to write a header (like a Read Cmd + EPROM address),
//         and then do an I2C Re-Start to read back the requested data.
//
//         It is analogous to ST's HAL_I2C_Mem_Read().
//         But it is brain damaged, because you can only write a fixed 2 bytes max !
//         DUMB !    See  HAL_I2C_Mem_Read() and  I2C_RequestMemoryRead()
//
//         For now, kow-tow to that goofiness, but later on make it more
//         general purpose, because sometimes Cmd + EPROM address exceeds 2 bytes !!!
//
// @param[in] pByteToTransmit pointer to the byte to transmit
// @param[in] pReceivedByte pointer to the received byte
// @retval    None
//*****************************************************************************

