GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c
int  board_i2c_read_header_data (unsigned int i2c_module_id, int slave_addr,
                                 uint16_t header_buffer,    int hbuf_length,
                                 uint8_t  *receive_buffer, int rbuf_length,
                                 int flags)
{
    I2C_HandleTypeDef  *pI2cHdl;
    I2C_IO_BUF_BLK     *ioblock;
    int                rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

    pI2cHdl   = ioblock->i2c_handle;            // get associated HAL handle

extern  I2C_HandleTypeDef  I2C_SHIELDS_Handle;  // TESTING HACK
extern  int   use_ST_i2c_read_code;             // TESTING HACK
if (pI2cHdl == 0L && use_ST_i2c_read_code == 1) // TESTING HACK (allow code Mix and Match)
   { pI2cHdl = &I2C_SHIELDS_Handle;   // TESTING HACK
     ioblock->i2c_handle = pI2cHdl;   // TESTING_HACK
     ioblock->i2c_max_timeout = 1000; // TESTING HACK
   }                                  // TESTING HACK

writ_ioblock = ioblock;             // DEBUG ONLY
writ_pI2cHdl = pI2cHdl;             // DEBUG ONLY
    if (ioblock->i2c_state == I2C_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);   // still working on a previous I/O

    if ( ! ioblock->i2c_use_interrupts)
       {        // Blocking and POLLING Mode
         rc = HAL_I2C_Mem_Read (ioblock->i2c_handle, slave_addr,
                                 header_buffer,  hbuf_length,
                                 receive_buffer, rbuf_length, ioblock->i2c_max_timeout);
       }
      else {    // Non-Blocking and INTERRUPT mode
             rc = HAL_I2C_Mem_Read_IT (ioblock->i2c_handle, slave_addr,
                                       header_buffer,  hbuf_length,
                                       receive_buffer, rbuf_length);
           }

// ??? WVD - add check and wait for BLOCKING I/O

    if (rc != HAL_OK)
       { ioblock->i2c_state = I2C_STATE_ERROR_COMPLETE;
         return (-1);
       }
      else ioblock->i2c_state = I2C_STATE_IO_COMPLETED; // Tag as successful I/O

    return (0);          // tell user it was started (Non-Block) or completed OK
}


//*****************************************************************************
//*****************************************************************************

int  board_i2c_write (unsigned int i2c_module_id,  int slave_addr,
                      uint8_t *transmit_buffer, int buf_length, int flags)
{
    I2C_HandleTypeDef  *pI2cHdl;
    I2C_TypeDef        *spibase;
    uint32_t           tickstart,  tickend;
    uint8_t            dummy;
    I2C_IO_BUF_BLK     *ioblock;
    int                rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

    pI2cHdl   = ioblock->i2c_handle;            // get associated HAL handle
    if (ioblock->i2c_state == I2C_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);   // still working on a previous I/O

    ioblock->i2c_buffer = transmit_buffer;    // save ptr to User I/O buf
    ioblock->i2c_length = buf_length;         // save amount of data to send
    ioblock->i2c_expiry_time = ioblock->i2c_max_timeout;   // set any max timeout

    ioblock->i2c_state = I2C_STATE_IO_PROCESSING; // denote I/O is now in progress

    spibase = (I2C_TypeDef*) pI2cHdl->Instance;     // Point to I2C peripheral HW
    if ( ! ioblock->i2c_use_interrupts)
       {        // POLLED I/O - wait until operation is complete, before return to app
//       if (ioblock->i2c_mode == I2C_SLAVE)
//          { spibase->DR = (*transmit_buffer);     // load a byte of data
//            buf_length--;
//          }

         if (ioblock->i2c_master_slave == I2C_MASTER)
            rc = HAL_I2C_Master_Transmit (ioblock->i2c_handle, slave_addr,
                                              transmit_buffer,
                                              buf_length, ioblock->i2c_max_timeout);
           else rc = HAL_I2C_Slave_Transmit (ioblock->i2c_handle,
                                                 transmit_buffer,
                                                 buf_length, ioblock->i2c_max_timeout);
         if (rc == HAL_OK)
            {
//            rc = OS_WAIT (ioblock->i2c_expiry_time); // Wait for the I/O to complete
//            if (rc != 0)
//               board_i2c_stop_io (ioblock); // I/O timed out. Stop any I/O call in progress
              ioblock->i2c_state = I2C_STATE_IO_COMPLETED;  // Tag as successful I/O
            }
       }

      else {    // INTERRUPT driven I/O
             if (ioblock->i2c_master_slave == I2C_MASTER)
                rc = HAL_I2C_Master_Transmit_IT (ioblock->i2c_handle, slave_addr,
                                                 transmit_buffer,
                                                 buf_length);
               else rc = HAL_I2C_Slave_Transmit_IT (ioblock->i2c_handle,
                                                    transmit_buffer,
                                                    buf_length);
           }

// ??? WVD !!! Add check and wait for Blocking I/O

    if (rc != HAL_OK)
       { ioblock->i2c_state = I2C_STATE_ERROR_COMPLETE;
         return (-1);
       }
      else ioblock->i2c_state = I2C_STATE_IO_COMPLETED;  // Tag as successful I/O

    return (0);        // tell user it was started (Non-Block) or completed OK
}


//*****************************************************************************
//  board_i2c_write_read
//
// @brief  This is used to write a header (like a Read Cmd + EPROM address),
//         and then do an I2C Re-Start to read in the reply.
//
//         It is analogous to ST's HAL_I2C_Mem_Read().
//         But it is brain damaged, because you can only write a fixed 2 bytes max !
//         DUMB !    See  HAL_I2C_Mem_Read() and  I2C_RequestMemoryRead()
//
//         For now, kow-tow to that goofiness, but later on make it more
//         general purpose, because sometimes Cmd + EPROM address exceeds 2 bytes !!!
//
// @param[in] pByteToTransmit pointer to the byte to transmit
// @param[in] pReceivedByte pointer to the received byte
// @retval    None
//*****************************************************************************
int  board_i2c_write_read (unsigned int i2c_module_id,  int slave_addr,
                           uint16_t header_buffer,   int hbuf_length,
// future                  uint8_t *transmit_buffer, int xbuf_length,
                           uint8_t *receive_buffer,  int rbuf_length,
                           int flags)
{
    I2C_HandleTypeDef  *pI2cHdl;
    I2C_IO_BUF_BLK     *ioblock;
    int                rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

    pI2cHdl   = ioblock->i2c_handle;            // get associated HAL handle
    if (ioblock->i2c_state == I2C_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);   // still working on a previous I/O

