GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_i2c.c
// ??? HUGH ==> UNFINISHED ??? !!!   WVD

    if ( ! ioblock->i2c_use_interrupts)
       {        // Blocking and POLLING Mode
         rc = HAL_I2C_Mem_Read (ioblock->i2c_handle, slave_addr,
                                header_buffer,  hbuf_length,
                                receive_buffer, rbuf_length, ioblock->i2c_max_timeout);
       }
      else {    // Non-Blocking and INTERRUPT mode
             rc = HAL_I2C_Mem_Read_IT (ioblock->i2c_handle, slave_addr,
                                       header_buffer,  hbuf_length,
                                       receive_buffer, rbuf_length);
           }

    if (rc != HAL_OK)
       { ioblock->i2c_state = I2C_STATE_ERROR_COMPLETE;
         return (-1);
       }
      else I2C_STATE_IO_COMPLETED;  // Tag as successful I/O

    return (0);        // tell user it was started (Non-Block) or completed OK
}


//*****************************************************************************
//  board_i2c_write_header_data
//
// @brief  This is used to write a header (like a Write Cmd + EPROM address),
//         and then do an I2C Re-Start to write out the rest of the data.
//
//         It is analogous to ST's HAL_I2C_Mem_Write().
//         But it is brain damaged, because you can only write a fixed 2 bytes max !
//         DUMB !    See  HAL_I2C_Mem_Write() and  I2C_RequestMemoryWrite()
//
//         For now, kow-tow to that goofiness, but later on make it more
//         general purpose, because sometimes Cmd + EPROM address exceeds 2 bytes !!!
//
// @param[in] pByteToTransmit pointer to the byte to transmit
// @param[in] pReceivedByte pointer to the received byte
// @retval    None
//*****************************************************************************

int  board_i2c_write_header_data (unsigned int i2c_module_id,  int slave_addr,
                                  uint16_t header_buffer,    int hbuf_length,
///   future                      uint8_t  *header_buffer,   int hbuf_length,
                                  uint8_t  *transmit_buffer, int xbuf_length,
                                  int flags)
{
    I2C_HandleTypeDef  *pI2cHdl;
    I2C_IO_BUF_BLK     *ioblock;
    int                rc;

    rc = board_i2c_get_module_ioblk (i2c_module_id, &ioblock); // get I2C IOBLK
    if (rc != 0)
       return (rc);        // module not valid. return error code to caller.

    pI2cHdl   = ioblock->i2c_handle;            // get associated HAL handle
writ_ioblock = ioblock;         // DEBUG ONLY
writ_pI2cHdl   = pI2cHdl;           // DEBUG ONLY
    if (ioblock->i2c_state == I2C_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);   // still working on a previous I/O

    if ( ! ioblock->i2c_use_interrupts)
       {        // Blocking and POLLING Mode
         rc = HAL_I2C_Mem_Write (ioblock->i2c_handle, slave_addr,
                                 header_buffer,   hbuf_length,
                                 transmit_buffer, xbuf_length, ioblock->i2c_max_timeout);
       }
      else {    // Non-Blocking and INTERRUPT mode
             rc = HAL_I2C_Mem_Write_IT (ioblock->i2c_handle, slave_addr,
                                        header_buffer,   hbuf_length,
                                        transmit_buffer, xbuf_length);
           }

// ??? WVD - add check and wait for BLOCKING I/O

    if (rc != HAL_OK)
       { ioblock->i2c_state = I2C_STATE_ERROR_COMPLETE;
         return (-1);
       }
      else ioblock->i2c_state = I2C_STATE_IO_COMPLETED; // Tag as successful I/O

    return (0);          // tell user it was started (Non-Block) or completed OK
}


   extern    int   i2c_rupt_module_id;            // TEMP_HACK


/*************************************************************************
*                                 TEMP  ISR   HACK
* @brief  I2C error callbacks.
* @param  hspi: I2C handle
*
* @note   This example shows a simple way to report transfer error,
*         and you canadd your own implementation.
* @retval None
*/
void  HAL_I2C_ErrorCallback (I2C_HandleTypeDef *hspi)
{
    I2C_IO_BUF_BLK     *ioblock;

    ioblock = (I2C_IO_BUF_BLK*) _g_i2c_io_blk_address [i2c_rupt_module_id];    // get assoc I/O block
    ioblock->i2c_state = I2C_STATE_ERROR_COMPLETE;   // set ending status

    if (ioblock->i2c_callback_handler != 0L)
       {             // Invoke user callback for the interrupt
         (ioblock->i2c_callback_handler) (ioblock->i2c_callback_parm,
                                          i2c_rupt_module_id, -1);  // signal error
       }
}


/************************************************************************
*                                 TEMP  ISR   HACK
*
* @brief  TxRx Transfer completed callback.
* @param  hspi: I2C handle.
*
* @note   This example shows a simple way to report end of
*         Interrupt TxRx transfer, and
*         you can add your own implementation.
* @retval None
*/
void  Internal_HAL_I2C_TxRxCpltCallback (I2C_HandleTypeDef *hi2c, int rupt_num)
{
    I2C_IO_BUF_BLK     *ioblock;

    ioblock = (I2C_IO_BUF_BLK*) _g_i2c_io_blk_address [rupt_num];  // get assoc I/O block
    ioblock->i2c_state = I2C_STATE_IO_COMPLETED;        // Tag as successful I/O

    if (ioblock->i2c_callback_handler != 0L)
       {             // Invoke user callback for the interrupt
         (ioblock->i2c_callback_handler) (ioblock->i2c_callback_parm,
                                          rupt_num, 0);  // signal good completion
       }
}


//void HAL_I2C_MasterTxCpltCallback (I2C_HandleTypeDef *hi2c)
//void HAL_I2C_MasterRxCpltCallback (I2C_HandleTypeDef *hi2c)
//void HAL_I2C_SlaveTxCpltCallback (I2C_HandleTypeDef *hi2c)
//void HAL_I2C_SlaveRxCpltCallback (I2C_HandleTypeDef *hi2c)
//void HAL_I2C_MemTxCpltCallback (I2C_HandleTypeDef *hi2c)
//void HAL_I2C_MemRxCpltCallback (I2C_HandleTypeDef *hi2c)
//{
//    Internal_HAL_I2C_TxRxCpltCallback (hi2c);
//}


//******************************************************************************
//                     COMMON    I2C     ISR / IRQ     Handler
//
// The i2c_interrupt_number ranges from 1 to n, and it indicates which
// I2Cx_IRQHandler invoked us: e.g. 1 = I2C1_IRQHandler, 2 = I2C2_IRQHandler.
// The handler is directly tied to the I2C modules I2C1, I2C2, ...
//******************************************************************************
    int   i2c_rupt_module_id = 0;            // TEMP_HACK

void  board_i2c_IRQ_Handler (int i2c_interrupt_number)
{
    I2C_IO_BUF_BLK  *ioblk;

    i2c_rupt_module_id = i2c_interrupt_number;

    ioblk = (I2C_IO_BUF_BLK*) _g_i2c_io_blk_address [i2c_interrupt_number];

    IO_SEMAPHORE_RELEASE (&ioblk->i2c_semaphore);  // clear any semaphore

// ??? !!! should also update ioblk's io_status to COMPLETED, to eliminate above i2c_rupt_module_id  ??? !!! WVD

    Internal_HAL_I2C_TxRxCpltCallback (ioblk->i2c_handle, i2c_interrupt_number);

    HAL_I2C_EV_IRQHandler (ioblk->i2c_handle);    // initial pass
    HAL_I2C_ER_IRQHandler (ioblk->i2c_handle);
}



//******************************************************************************
//                     COMMON    I2C     ERROR   IRQ     Handler
//
// The i2c_interrupt_number ranges from 1 to n, and it indicates which
// I2Cx_IRQHandler invoked us: e.g. 1 = I2C1_IRQHandler, 2 = I2C2_IRQHandler.
// The handler is directly tied to the I2C modules I2C1, I2C2, ...
//******************************************************************************
void  board_i2c_ERRIRQ_Handler (int i2c_interrupt_number)
{
    I2C_IO_BUF_BLK  *ioblk;

    i2c_rupt_module_id = i2c_interrupt_number;

    ioblk = (I2C_IO_BUF_BLK*) _g_i2c_io_blk_address [i2c_interrupt_number];

    IO_SEMAPHORE_RELEASE (&ioblk->i2c_semaphore);  // clear any semaphore

    HAL_I2C_ER_IRQHandler (ioblk->i2c_handle);    // initial pass
}

/******************************************************************************/
